Revit 2022 API
ThermalAsset Constructor
 Constructs an instance of ThermalAsset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2013
Syntax
C#
public ThermalAsset(
	string name,
	ThermalMaterialType materialType
)
Visual Basic
Public Sub New ( _
	name As String, _
	materialType As ThermalMaterialType _
)
Visual C++
public:
ThermalAsset(
	String^ name,
	ThermalMaterialType materialType
)
Parameters
name
Type: System.String
 The name of the asset.
materialType
Type: Autodesk.Revit.DB.ThermalMaterialType
 The type of thermal material that this asset will describe.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name is an empty string. -or- name cannot include prohibited characters.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace